---
title: ElectricalDemandFactorValue
classe: Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue
namespace: Autodesk.Revit.DB.Electrical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ElectricalDemandFactorValue

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Factor { get; set; }` | `electricalDemandFactorValue.Factor` | Double |
| `Boolean IsValidObject { get; }` | `electricalDemandFactorValue.IsValidObject` | Boolean |
| `Double MaxRange { get; set; }` | `electricalDemandFactorValue.MaxRange` | Double |
| `Double MinRange { get; set; }` | `electricalDemandFactorValue.MinRange` | Double |
| `Void Dispose()` | `electricalDemandFactorValue.Dispose()` | Void |
| `Void SetMaxRangeToUnlimited()` | `electricalDemandFactorValue.SetMaxRangeToUnlimited()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```